Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54N19A.PIC
      <edc:SFRDef edc:_addr="0x4100A02C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PENDCH" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:desc="Pending Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:desc="Pending Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:desc="Pending Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:desc="Pending Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:desc="Pending Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:desc="Pending Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:desc="Pending Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:desc="Pending Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:desc="Pending Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:desc="Pending Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:desc="Pending Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:desc="Pending Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:desc="Pending Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:desc="Pending Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:desc="Pending Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:desc="Pending Channel 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH16" edc:desc="Pending Channel 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH17" edc:desc="Pending Channel 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH18" edc:desc="Pending Channel 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH19" edc:desc="Pending Channel 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH20" edc:desc="Pending Channel 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH21" edc:desc="Pending Channel 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH22" edc:desc="Pending Channel 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH23" edc:desc="Pending Channel 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH24" edc:desc="Pending Channel 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH25" edc:desc="Pending Channel 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH26" edc:desc="Pending Channel 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH27" edc:desc="Pending Channel 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH28" edc:desc="Pending Channel 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH29" edc:desc="Pending Channel 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH30" edc:desc="Pending Channel 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH31" edc:desc="Pending Channel 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A030" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:cname="ACTIVE" edc:impl="0xFFFF9F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:desc="Level 0 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:desc="Level 1 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:desc="Level 2 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:desc="Level 3 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Active Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:desc="Active Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:desc="Active Channel Block Transfer Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BASEADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="Descriptor Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRBADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:desc="Write-Back Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A03C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4100A040" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL0CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A044" edc:access="------nn" edc:cname="CHANNEL0CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
