Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54N19A.PIC
      <edc:AdjustPoint edc:_addr="0x45000055" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x45000058" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ASAR0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="ADMASA" edc:desc="ADMA System Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4500005C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x45000060" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR0" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000062" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR1" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000064" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR2" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000066" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR3" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000068" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR4" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4500006A" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR5" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4500006C" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR6" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4500006E" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR7" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
