Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54N19A.PIC
      <edc:SFRDef edc:_addr="0x46000038" edc:access="-n-----nnnnnnnnn" edc:cname="NISIER" edc:impl="0x41FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDC" edc:desc="Command Complete Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRFC" edc:desc="Transfer Complete Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLKGE" edc:desc="Block Gap Event Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAINT" edc:desc="DMA Interrupt Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BWRRDY" edc:desc="Buffer Write Ready Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRDRDY" edc:desc="Buffer Read Ready Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINS" edc:desc="Card Insertion Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CREM" edc:desc="Card Removal Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINT" edc:desc="Card Interrupt Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BOOTAR" edc:desc="Boot Acknowledge Received Signal Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600003A" edc:access="---n--nnnnnnnnnn" edc:cname="EISIER" edc:impl="0x13FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:desc="Command Timeout Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:desc="Command CRC Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:desc="Command End Bit Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:desc="Command Index Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:desc="Data Timeout Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:desc="Data CRC Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:desc="Data End Bit Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:desc="Current Limit Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:desc="Auto CMD Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:desc="ADMA Error Signal Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:desc="Boot Acknowledge Error Signal Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600003C" edc:access="--------r--rrrrr" edc:cname="ACESR" edc:impl="0x9F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ACMD12NE" edc:desc="Auto CMD12 Not Executed" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="EXEC" edc:desc="Executed" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NOT_EXEC" edc:desc="Not executed" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDTEO" edc:desc="Auto CMD Timeout Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Timeout" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDCRC" edc:desc="Auto CMD CRC Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="CRC Error Generated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEND" edc:desc="Auto CMD End Bit Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="End Bit Error Generated" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDIDX" edc:desc="Auto CMD Index Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMDNI" edc:desc="Command not Issued By Auto CMD12 Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OK" edc:desc="No error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ISSUED" edc:desc="Not Issued" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600003E" edc:access="nn------nnnnnnnn" edc:cname="HC2R" edc:impl="0xC0FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="HS200EN" edc:desc="HS200 Mode Enable" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SDR12" edc:desc="SDR12" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SDR25" edc:desc="SDR25" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SDR50" edc:desc="SDR50" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SDR104" edc:desc="SDR104" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DDR50" edc:desc="DDR50" edc:when="(field &amp; 0xF) == 4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="VS18EN" edc:desc="1.8V Signaling Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="S33V" edc:desc="3.3V Signaling" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="S18V" edc:desc="1.8V Signaling" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected (Default)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EXTUN" edc:desc="Execute Tuning" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Not Tuned or Tuning Completed" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REQUESTED" edc:desc="Execute Tuning" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLCKSEL" edc:desc="Sampling Clock Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="Fixed clock is used to sample data" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TUNED" edc:desc="Tuned clock is used to sample data" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ASINTEN" edc:desc="Asynchronous Interrupt Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PVALEN" edc:desc="Preset Value Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HOST" edc:desc="SDCLK and Driver Strength are controlled by Host Controller" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="Automatic Selection by Preset Value is Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000040" edc:access="rrrr-rrrrrr-rrrrrrrrrrrrr-rrrrrr" edc:cname="CA0R" edc:impl="0xF7EFFFBF" edc:mclr="00100111111010000000000010000000" edc:nzwidth="0x20" edc:por="00100111111010000000000010000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="TEOCLKF" edc:desc="Timeout Clock Frequency" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0x3F) == 0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEOCLKU" edc:desc="Timeout Clock Unit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="KHZ" edc:desc="KHz" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MHZ" edc:desc="MHz" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BASECLKF" edc:desc="Base Clock Frequency" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="OTHER" edc:desc="Get information via another method" edc:when="(field &amp; 0xFF) == 0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXBLKL" edc:desc="Max Block Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="2048" edc:desc="2048 bytes" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ED8SUP" edc:desc="8-bit Support for Embedded Device" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="8-bit Bus Width not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="8-bit Bus Width Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA2SUP" edc:desc="ADMA2 Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="ADMA2 not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="ADMA2 Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HSSUP" edc:desc="High Speed Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="High Speed not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="High Speed Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDMASUP" edc:desc="SDMA Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="SDMA not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="SDMA Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRSUP" edc:desc="Suspend/Resume Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Suspend/Resume not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Suspend/Resume Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V33VSUP" edc:desc="Voltage Support 3.3V" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="3.3V Not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="3.3V Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V30VSUP" edc:desc="Voltage Support 3.0V" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="3.0V Not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="3.0V Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="V18VSUP" edc:desc="Voltage Support 1.8V" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="1.8V Not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="1.8V Supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SB64SUP" edc:desc="64-Bit System Bus Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="32-bit Address Descriptors and System Bus" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="64-bit Address Descriptors and System Bus" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASINTSUP" edc:desc="Asynchronous Interrupt Support" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Asynchronous Interrupt not Supported" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Asynchronous Interrupt supported" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLTYPE" edc:desc="Slot Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="REMOVABLE" edc:desc="Removable Card Slot" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="EMBEDDED" edc:desc="Embedded Slot for One Device" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
